Revit 2027 API
Element.GetValidTypes Method
 Obtains a set of types that are valid for this element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetValidTypes()
Public Function GetValidTypes As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetValidTypes()
member GetValidTypes : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
 A set of element IDs of types that are valid for this element or an empty set if element cannot have type assigned.
See Also
Reference
Element Class
GetValidTypes Overload
Autodesk.Revit.DB Namespace